11/data/attachments/811e6c74739315f0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Matthew_generation_Friend_58127_7</nif:username>
            <nif:friendToBeRequested>soap_friends_f44feef8-80c9-46ad-b346-0d43c6c31f8f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>